#ifndef FMPFILE_H
#define FMPFILE_H

#include "EMO_BaseFile.h"


namespace LibXenoverse
{


#ifdef _MSC_VER
#pragma pack(push,1)
#endif

#define FMP_SIGNATURE "#FMP"

// All offsets of file are absolute

struct FMP_Header
{
	char signature[4];			// 0
	uint32_t version;			// 4
	uint32_t unk_08;			// 8	must be an even number. [A] always 0x12
	uint32_t unk_0C;			// C	[A] always 0
	
	uint32_t offset_Section0a;	// 10	Offset ([A] always 0x70 because of header Size)
	uint32_t offset_Section0b;	// 14	Offset ([A] always 0xFC)
	uint32_t numberSection1;	// 18
	uint32_t offset_Section1;	// 1C
	uint32_t numberSection2;	// 20
	uint32_t offset_Section2;	// 24
	uint32_t numberSection3;	// 28
	uint32_t offset_Section3;	// 2C
	uint32_t numberSection4;	// 30
	uint32_t offset_Section4;	// 34;
	uint32_t numberSection5;	// 38
	uint32_t offset_Section5;	// 3C
	
	uint32_t numberFileInDependance_Nsk; // 40						//=>  dans les Qst et EVe, il n'y en a pas, et dans le BFten.map, il y a des noms ajouté : du style les noms de fichiers, de model, "Start Frame" "Speed Rate", "PLAY SOUND 3D" , etc ...
	uint32_t offset_Dependance_Nsk; // 44
	uint32_t numberFileInDependance_TextureEmb; // 48
	uint32_t offset_Dependance_TextureEmb; // 4C
	uint32_t numberFileInDependance_Emm; // 50
	uint32_t offset_Dependance_Emm; // 54
	uint32_t numberFileInDependance_Ema; // 58
	uint32_t offset_Dependance_Ema; // 5C
	
	uint32_t unk_60;			// 60 Found to be zero  but game code references first two. [A] always 0
	uint32_t unk_64;			// 64
	uint32_t unk_68;			// 68
	uint32_t unk_6C;			// 6C
} PACKED;
static_assert(sizeof(FMP_Header) == 0x70, "Incorrect structure size.");



// 70 -> FC => 8C = 140 = 35 * 4. d'ou vient les 35 valeurs ? Note: on a 0x12 (36) comme valeur inconue, ca a peut etre un rapport ?
struct FMP_Section0a
{
	float width_X;						// 0	=> 00 40 1C 46 (10000 en float ) (si couleur vert sombre, tres transparent 0.274 )
	float width_Y;						// 4	=> [A] always as unk_0
	float width_Z;						// 8	=> [A] always as unk_0

	float unk_3;						// C	=> [A] always  0
	float unk_4;						// 10	=> [A] always  0
	float unk_5;						// 14	=> [A] always  0

	float unk_6;						// 18	=> CD CC 1C C1  (-9, 8000001907349 en float), ca pourrait etre une couleur (vert caca d'oie, un peu transparente).
	uint32_t unk_7;						// 1C	=> [A] always 4			(5,6051938572993e-045 si float)

	float unk_8;						// 20	=> 3A CD 13 3F, (si couleur, vert tres transparent 0.24 ) (0,57735025882721 si float)
	float unk_9;						// 24	=> 3A CD 13 BF, (si couleur, vert un peu transparent ) (-0,57735025882721  si float)
	float unk_10;					// 28	=> 3A CD 13 3F, (si couleur, vert tres transparent 0.24 ) (0,57735025882721 si float)

	float unk_11;					// 2C	=> [A] always 9A 99 99 3E, (si couleur, gris tres transparent 0.24 ) (0,30000001192093 si float)
	float unk_12;					// 30	=> [A] always 9A 99 99 3E, (si couleur, gris tres transparent 0.24 ) (0,30000001192093 si float)
	float unk_13;					// 34	=> [A] always 9A 99 99 3E, (si couleur, gris tres transparent 0.24 ) (0,30000001192093 si float)

	float unk_14;					// 38	=> [A] always 33 33 33 3F, (si couleur, gris sombre tres transparent 0.24 ) (0,69999998807907 si float)
	float unk_15;					// 3C	=> [A] always 33 33 33 3F, (si couleur, gris sombre tres transparent 0.24 ) (0,69999998807907 si float)
	float unk_16;					// 40	=> [A] always 33 33 33 3F, (si couleur, gris sombre tres transparent 0.24 ) (0,69999998807907 si float)

	float unk_17;					// 44	=> [A] always 00 00 C8 42, (si couleur, bleu tres transparent) (100 si float)
	float unk_18;					// 48	=> [A] always 00 00 FA 43, (si couleur, bleu tres transparent) (500 si float)

	float unk_19;					// 4C	=> [A] always 0
	float unk_20;					// 50	=> [A] always 0
	float unk_21;					// 54	=> [A] always 0

	float unk_22;					// 58	=> [A] always 00 00 80 3F, (si couleur, bleu tres transparent) (1 si float)
	float unk_23;					// 5C	=> [A] always 00 00 80 3F, (si couleur, bleu tres transparent) (1 si float)
	float unk_24;					// 60	=> [A] always 00 00 80 3F, (si couleur, bleu tres transparent) (1 si float)

	float unk_25;					// 64	=> [A] always 00 00 C8 42, (si couleur, bleu tres transparent) (100 si float)
	float unk_26;					// 68	=> [A] always 00 00 96 43, (si couleur, bleu tres transparent) (300 si float)
	float unk_27;					// 6C	=> [A] always 00 00 96 42, (si couleur, bleu tres transparent) (75 si float)
	float unk_28;					// 70	=> [A] always 00 00 48 42, (si couleur, bleu tres transparent) (50 si float)

	float unk_29;					// 74	=> [A] always 00 00 00 3F, (si couleur, noir tres transparent) (0,5 si float)
	float unk_30;					// 78	=> [A] always 00 00 00 3F, (si couleur, noir tres transparent) (0,5 si float)
	float unk_31;					// 7C	=> [A] always 00 00 00 3F, (si couleur, noir tres transparent) (0,5 si float)

	float nearDistance;				// 80	=> CD CC CC 3D, (si couleur, gris tres transparent) (0,10000000149012 si float)
	float farDistance;				// 84	=> 00 00 7A 44, (si couleur, bleu tres transparent) (1000 si float)
	float unk_34;					// 88	=> D8 0F 49 3F, (si couleur, rose/rouge tres transparent) (0,78539800643921 si float)

} PACKED;
static_assert(sizeof(FMP_Section0a) == 0x8C, "Incorrect structure size.");






//todo terminer
// FC -> 2f8 => 1FC = 508

struct FMP_Section0b
{
	uint32_t unk_0;						// 0	=> 18 61 B9 7C (7.7003537122912e+036 en float )
	uint32_t unk_1;						// 4	=> 0
	uint32_t unk_2;						// 8	=> 46 58 2E 17 (5,6333849001565e-025 en float )
	uint32_t unk_3;						// C	=> 0
	uint32_t unk_4;						// 10
	uint32_t unk_5;						// 14
	uint32_t unk_6;						// 18
	uint32_t unk_7;						// 1C
	uint32_t unk_8;						// 20
	uint32_t unk_9;						// 24
	uint32_t unk_10;					// 28
	uint32_t unk_11;					// 2C
	uint32_t unk_12;					// 30
	uint32_t unk_13;					// 34
	uint32_t unk_14;					// 38
	uint32_t unk_15;					// 3C
	uint32_t unk_16;					// 40
	uint32_t unk_17;					// 44
	uint32_t unk_18;					// 48
	uint32_t unk_19;					// 4C
	uint32_t unk_20;					// 50
	uint32_t unk_21;					// 54
	uint32_t unk_22;					// 58
	uint16_t unk_23;					// 5C
	uint16_t unk_23b;					// 5E
	uint32_t unk_24;					// 60
	uint32_t unk_25;					// 64
	uint32_t unk_26;					// 68
	uint32_t unk_27;					// 6C
	uint32_t unk_28;					// 70
	uint32_t unk_29;					// 74
	uint32_t unk_30;					// 78
	uint32_t unk_31;					// 7C
	uint32_t unk_32;					// 80
	uint32_t unk_33;					// 84
	uint32_t unk_34;					// 88
	uint32_t unk_35;					// 8C
	uint32_t unk_36;					// 90
	uint32_t unk_37;					// 94
	uint32_t unk_38;					// 98
	uint32_t unk_39;					// 9C
	uint32_t unk_40;					// A0
	uint32_t unk_41;					// A4
	uint32_t unk_42;					// A8
	uint32_t unk_43;					// AC
	uint32_t unk_44;					// B0
	uint32_t unk_45;					// B4
	uint32_t unk_46;					// B8
	uint32_t unk_47;					// BC
	uint32_t unk_48;					// C0
	uint32_t unk_49;					// C4
	uint32_t unk_50;					// C8
	uint32_t unk_51;					// CC
	uint32_t unk_52;					// D0
	uint32_t unk_53;					// D4
	uint32_t unk_54;					// D8
} PACKED;
static_assert(sizeof(FMP_Section0b) == 0xDC, "Incorrect structure size.");

//+padding for having 256 (after Section0A)
//after there is 51 nameOffset, may be some general types



struct FMP_Section1
{
	uint32_t name_offset;			// 0	[A] TRIGGER_BROAD_PHASE, TRIGGER_NARROW_PHASE, TRIGGER_CONTACT_SOLVER, Default, or some "__X"
	uint32_t unk_04;				// 4	[A] 1, 2, 3 (increment), but at the end we have 0 for Default and "__X"
	float unk_08;					// 8	[A] values are in [0, 1.0]
	float unk_0C;					// C	[A] values are in [0, 1.0]
	float unk_10;					// 10	[A] values are in [0, 1.0]
	float unk_14;					// 14	[A] 999936.0, 0.0 or 0.104279 => i'm not sure is a float value
} PACKED;
static_assert(sizeof(FMP_Section1) == 0x18, "Incorrect structure size.");


struct FMP_Section2
{
	uint32_t name_offset;			// 0	[A] Default or some '__X'. => could refer to Unk1Entry by name (without knowed Triggers) => wrong (unk1E __118 with unk2E __105)
	float unk_04;					// 4	0.0, 1.0, 2.0 or 3.0. We feel 0 and 1, 2 and 3, 4 and 5, are together.
	float unk_08;					// 8	is always 1.0.
	float unk_0C;					// C	200.0 or 300.0
	float unk_10;					// 10	100.0, or 300.0. 
	float unk_14;					// 14	is in [0,2.0]
	float unk_18;					// 18	is in [0, 10.0]
} PACKED;
static_assert(sizeof(FMP_Section2) == 0x1C, "Incorrect structure size.");



struct FMP_Section3
{
	uint32_t name_offset;			// 0	[A] as 'stone', 'Gate', 'Tree', etc... there is some special : 'InitPos', 'Quest', 'Quest_X', 'Master_XXX' (name of Charac), 'hakai' (trad as 'destruction'), 'Fragments_X', 'EXP_OFF', 'Break_OFF', 'ACT', 'InstanceObject', 'EFCT', 'BG', 'REF', 'All', 'EVE', 'NPC_SH', 'Main', 'ObjIns_Palm', CLPC_POS, RECEIPT, FRIEND, TELEPORT, CONFLICT, SUBAREA, Collision, AREA_XXXXX, chase_battle, EMOTION, DB (for DragonBall), Respawn_Point, EVE_Point, Camera, GroupX, NPC_TALK, MainScenario, OnlineEventFs, TEACHER, 'Env Sound' . the fact as there is 'break' and 'Break' said it's not case sensitive.  a lot of name are for the free world, like shops, character for teachers ans npc. 
	uint32_t num_indexes;			// 4	
	uint32_t indexes_offset;		// 8	Points to table of 16 bits integers. Indexes are relative to Unk4Entrys
} PACKED;
static_assert(sizeof(FMP_Section3) == 0xC, "Incorrect structure size.");


// Here FMP_Section3_indexes











struct FMP_Section4
{
	uint32_t name_offset;		// 0	[A] as BFtok01, SUN, sound_ENV, HYPNO_TARGET, HYPNO_OWN, HYPNO_BACK_OWN, SKY, EFCT_smoke, GATE_to_XXXX (other part of the level), EFCT_Wind00_00, FragmentsFXX_XXXX (for sol grass). insStoneAcol, ULC_END_OWNER, ULC_END_MEMBER_X, ULC_END_HIT_X, ULC_END_GUARD_X, VS_INIT_POS_A_X, VS_INIT_POS_B_X, AI_MOVE_XX, QUEST_FORMAT, TRESPASS_X, MSTSPASS_X, QUEST_ITEM_XX, _initPos, GATE_to_BFceb, GATE_EXP_IN, GATE_EXP_OUT_0, LOCALBATTLE, insGrassX, ULC_XX_END_OWNER, ULC_XX_END_MEMBER_X, LOCAL_VS_INIT_POS_1P, LOCAL_VS_INIT_POS_2P, RISAN_BLOW_FIRE_PORT_X, MST_GOK_00_POS_XX, bnSKY, ENVTEX, Initialize, SetShadowArea, hRISAN_Worm_Hole_0, HYPERSHOT_00, HYPERSHOT_return, WATER, REF00,  EFCT_TakiA, ACT06_hune, ACT06_Event, bnTreeset, BFiceh97_TreeXXX, Taki_Collision, COMa10, COMa10_XXX, 00_ivent, 00_ivent_XXX, sound_fall, QUEST_DB_COLLECT (the space and time ship), EFCT_ICE_ID0020_01, GPUParticle, NG_GNT_001, watersurface, Event_water (when we go through ?), QUEST_ITEM_XX, Initiarize, EFCT_glowflyXX, NoiseTEX, BFkaiGrassMassX, GATE_toXX_float, GATE_toXX_stand, SmallScene, LBY10, AI_MOVE_XX, (next is for free world) PROLOGUE_STANDBY_TKT, PLAYERPOS_01, PROLOGUE_PLAYERPOS_00, FLYINGLOCK_PLAYER_00, TUTORIAL_POINT_PC, TUTORIAL_POINT_NPC, POINT_COMEBACK_TOKI, Hologram, MOVE_TO_LBY04, RESPAWNPOS_XX, CAMERA_AREA_OUT_00, WARPPOS_XX, NPC_TELEPORT_name_0100_00 (the name displayed up to geometry), NPC_TEACHER_XXX, X_Env_Sound_XX_X, Env_Sound_XX_X
	uint16_t unk_04;			// 4	[A] 0, 1, 0x10001 =>  sort of flag. for the right bit, may be 0 for instanced objects and particules. 1 for the rest (so could be a bool 'instanced')
	uint16_t unk_04b;			// 4	[A] 0, 1, 0x10001 =>  sort of flag. for the right bit, may be 0 for instanced objects and particules. 1 for the rest (so could be a bool 'instanced')
	uint16_t index_Section5;		// 8	[A] always 0xffff if unk_04==0.
	
	int8_t  unk_0A;					// a	Signed, compared against < 0
	int8_t  unk_0B;					// b	Signed, compared against < 0
	uint32_t offset_Section4_Next;	// C   (0x50*n, n is get somehow from Section5) => Section4_Next (Notice many Section4 could use the same offset)
	uint32_t offset_Section4_Next3;	// 10	=> to Section4_Next3 (Notice many Section4 could use the same offset)

	uint32_t number_Section4_Next2;	// 14	[A] 0 1 or 2, so it's could be a type
	uint32_t offset_Section4_Next2;	// 18	=> Ref to Section4_Next2 (Notice many Section4 could use the same offset)
	uint32_t offset_Section4_Next4;	// 1C	=> Ref to Section4_Next4 (Notice many Section4 could use the same offset)
	float unk_20;					// 20
	float transformMatrix4x3[12];	//=> m00, m01, m02 / m10, , m11, , m12 / m20, , m21, , m22 / m30, , m31, , m32 (translation) /
} PACKED;
static_assert(sizeof(FMP_Section4) == 0x54, "Incorrect structure size.");





struct FMP_Section4_Next
{
	uint32_t number_Section4_Next_b; // 0		=> [A] 0, 1 or 2 (may be a type)
	uint32_t offset_Section4_Next_b; // 4		=> to Section4_Next_b
	
	uint32_t offset_Section4_Next_c; // 8		=> to Section4_Next_c
	uint32_t offset_Section4_Next_c_2; // C		=> another to Section4_Next_c
	uint32_t offset_Section4_Next_d; // 10		=> 0 => Ref to Section4_Next_d

	uint16_t unk_2;				// 14			=> only 1  or 0
	uint16_t unk_2b;			// 16			=> only FFFF or 0
	float unk_4;				// 18			=> 0
	float unk_5;				// 1C			=> 0

	float transformMatrix4x3[12];	// 20 => m00, m01, m02 / m10, , m11, , m12 / m20, , m21, , m22 / m30, , m31, , m32 (translation) /
} PACKED;
static_assert(sizeof(FMP_Section4_Next) == 0x50, "Incorrect structure size.");


struct FMP_Section4_Next_b			//from Section4_Next.unk1_offset
{
	uint32_t unk_0;				// 0			=>
	uint32_t unk_1;				// 4			=>
} PACKED;
static_assert(sizeof(FMP_Section4_Next_b) == 0x8, "Incorrect structure size.");


struct FMP_Section4_Next_c			//from Section4_Next.unk2_offset
{
	uint16_t unk_0;				// 0			=> 
	uint16_t unk_0b;			// 2			=> 
	uint16_t unk_1;				// 4			=>
	uint16_t unk_1b;			// 6			=>
	uint32_t unk_2;				// 8			=>
	float unk_3;				// C			=>
	float unk_4;				// 10			=>
	float unk_5;				// 14			=>
	float unk_6;				// 18			=>
	float unk_7;				// 1C			=>
	float unk_8;				// 20			=>
	float unk_9;				// 24			=>
	float unk_10;				// 28			=>
	float unk_11;				// 2C			=>
	float unk_12;				// 30			=>
	float unk_13;				// 34			=> lot of high values ... strange
	float widthX;				// 38			=> may be widthX of the Area witch the gate is targetable/usable (in case of gate)
	float widthY;				// 3C			=> 
	float widthZ;				// 40			=> 
	float quaternionX;			// 44			=> 
	float quaternionY;			// 48			=> 
	float quaternionZ;			// 4C			=> 
	float quaternionW;			// 50			=> 
} PACKED;
static_assert(sizeof(FMP_Section4_Next_c) == 0x54, "Incorrect structure size.");


struct FMP_Section4_Next_d			//from Section4_Next.unk3_offset
{
	uint32_t unk_0;				// 0			=>
	uint8_t unk_1a;				// 4			=>
	uint8_t unk_1b;				// 5			=>
	uint8_t unk_1c;				// 6			=>
	uint8_t unk_1d;				// 7			=>
	uint32_t number_Section4_Next_e; // 8		=>
	uint32_t offset_Section4_Next_e; // C		=> Ref to Section4_Next_e
} PACKED;
static_assert(sizeof(FMP_Section4_Next_d) == 0x10, "Incorrect structure size.");


struct FMP_Section4_Next_e			//from Section4_Next_d.unk1_offset
{
	uint32_t name_offset;		// 0			=>
	uint8_t unk_1a;				// 4			=>
	uint8_t unk_1b;				// 5			=>
	uint8_t unk_1c;				// 6			=>
	uint8_t unk_1d;				// 7			=>
	uint32_t number_Section4_Next_f; // 8		=>
	uint32_t offset_Section4_Next_f; // C		=> Ref to Section4_Next_f
} PACKED;
static_assert(sizeof(FMP_Section4_Next_e) == 0x10, "Incorrect structure size.");


struct FMP_Section4_Next_f			//list of parameters
{
	uint32_t name_offset;		// 0			=>
	uint32_t type_Data;			// 4			=> if ==6, unk1_offset is a nameOffset. so it's a type. 0: bool , 1: uint, 2  float
	uint32_t offset_Data;		// 8			=> Ref to a unique Value. it's a nameOffset if unk_0 == 6
} PACKED;
static_assert(sizeof(FMP_Section4_Next_f) == 0xC, "Incorrect structure size.");







struct FMP_Section4_Next3		//from Section4.unk2_offset
{
	uint32_t unk_0;			// 0			=> 0	[A] only 0,1,2,3 or 4 (may be a type)
	uint8_t unk_1a;			// 4			=>
	uint8_t unk_1b;			// 5			=> may be 2 uint4
	uint8_t unk_1c;			// 6			=>
	uint8_t unk_1d;			// 7			=> may be 2 uint4 
	uint32_t number_Section4_Next3_b; // 8	=> 0
	uint32_t offset_Section4_Next3_b; // C	=> to Section4_Next3_b
} PACKED;
static_assert(sizeof(FMP_Section4_Next3) == 0x10, "Incorrect structure size.");


struct FMP_Section4_Next3_b			//from Section4_Next3.unk1_offset
{
	uint32_t name_offset;		// 0			=> 
	uint8_t unk_1a;				// 4			=>
	uint8_t unk_1b;				// 4			=>
	uint8_t unk_1c;				// 4			=>
	uint8_t unk_1d;				// 4			=>
	uint32_t number_Section4_Next_f; // 8		=> old Next3_c is exactly like offset_Section4_Next_f
	uint32_t offset_Section4_Next_f; // C		=> to Section4_Next3_c
} PACKED;
static_assert(sizeof(FMP_Section4_Next3_b) == 0x10, "Incorrect structure size.");





struct FMP_Section4_Next2
{
	uint32_t offset_Section4_Next2_b; // 0		=> ref to FMP_Section4_Next2_b

	uint32_t unk_0;				// 4
	float transformMatrix4x3[12];	//=> m00, m01, m02 / m10, , m11, , m12 / m20, , m21, , m22 / m30, , m31, , m32 (translation) /

} PACKED;
static_assert(sizeof(FMP_Section4_Next2) == 0x38, "Incorrect structure size.");


struct FMP_Section4_Next2_b
{
	uint32_t name_offset;		// 0

	uint32_t unk_0;				// 4
	uint32_t number_Lod;		// 8		=> if 1, direct index for nsk and Emm (and float for LodDistance), else they are ref to a series of index (or floats)
	uint32_t indexNsk;			// C		=> ref to Dep1 (geometry). or Ref to a series of index ref to Dep1
	uint32_t indexTextureEmb;  // 10	=> ref to Dep2 (textures emb) ? 
	uint32_t indexEmm;			// 14	=> ref to Dep3 (emm).  or Ref to a series of index ref to Dep3
	uint32_t unk_5;				// 18
	uint32_t unk_6;				// 1C
	uint32_t indexEma;			// 20	=> ref to Dep4 (ema).
	uint32_t unk_8;				// 24
	float unk_9;				// 28		=> may be a widthX
	float unk_10;				// 2C		=> may be a widthY
	float lodDistance;			// 30		=> float or ref to series of float.
} PACKED;
static_assert(sizeof(FMP_Section4_Next2_b) == 0x34, "Incorrect structure size.");







struct FMP_Section4_Next4
{
	uint32_t number_Section4_Next4_c; // 0		=> count for Section4_Next4_c
	uint32_t number_Section4_Next4_b; // 4		=> count for Section4_Next4_b

	uint32_t offset_Section4_Next4_b; // 8		=> ref to Section4_Next4_b
	uint32_t offset_Section4_Next4_d; // C		=> ref to Section4_Next4_d
	uint32_t offset_Section4_Next4_c; // 10		=> ref to Section4_Next4_c
} PACKED;
static_assert(sizeof(FMP_Section4_Next4) == 0x14, "Incorrect structure size.");

struct FMP_Section4_Next4_b
{
	float unk_0;				// 0
	float unk_1;				// 4
	float unk_2;				// 8
	float unk_3;				// C
	float unk_4;				// 10
	float unk_5;				// 14
	float unk_6;				// 18
	float unk_7;				// 1C
	float unk_8;				// 20
	float unk_9;				// 24
	uint32_t unk_10;			// 28
	uint32_t indexToNext4_c_Transform;	// 2C
	
} PACKED;
static_assert(sizeof(FMP_Section4_Next4_b) == 0x30, "Incorrect structure size.");


struct FMP_Section4_Next4_c
{
	float positionX;			// 0
	float positionY;			// 4
	float positionZ;			// 8
	float rotationX;			// C	angle in radians Todo convert into degrees for Xml
	float rotationY;			// 10
	float rotationZ;			// 14	angle in radians
	float scaleX;				// 18	a lot of 1.0. for me 3 are a scale
	float scaleY;				// 1C	a lot as the same as unk6
	float scaleZ;				// 20	a lot as the same as unk6
} PACKED;
static_assert(sizeof(FMP_Section4_Next4_c) == 0x24, "Incorrect structure size.");




struct FMP_Section4_Next4_d
{
	uint8_t type;				// 0		=> if 0x2000 -> followed by Section4_Next4_e. if 1 is Indexes. if 0 it's a FMP_Section4_Next4_f
	uint8_t typeb;				// 		=> if 0x2000 -> followed by Section4_Next4_e. if 1 is Indexes. if 0 it's a FMP_Section4_Next4_f
	uint16_t number_Index;		// 2		=> number of followed Index (with padding to match uint32_t) => could be the same number as Next4_b ? todo check
	
} PACKED;
static_assert(sizeof(FMP_Section4_Next4_d) == 0x4, "Incorrect structure size.");


struct FMP_Section4_Next4_e					//could be recursive with Section4_Next4_d
{
	float unk_0;				// 0
	float unk_1;				// 4
	float unk_2;				// 8

	uint32_t unk0_offset;		// C	=> ref to a FMP_Section4_Next4_d
	uint32_t unk1_offset;		// 10	=> ref to a FMP_Section4_Next4_d
	uint32_t unk2_offset;		// 14	=> ref to a FMP_Section4_Next4_d
	uint32_t unk3_offset;		// 18	=> ref to a FMP_Section4_Next4_d
	uint32_t unk4_offset;		// 1C	=> ref to a FMP_Section4_Next4_d
	uint32_t unk5_offset;		// 20	=> ref to a FMP_Section4_Next4_d
	uint32_t unk6_offset;		// 24	=> ref to a FMP_Section4_Next4_d
	uint32_t unk7_offset;		// 28	=> ref to a FMP_Section4_Next4_d
} PACKED;
static_assert(sizeof(FMP_Section4_Next4_e) == 0x2C, "Incorrect structure size.");




















/////////////////////////////////////////////////////////////////////////////////




struct FMP_Section5
{
	uint32_t name_offset;				// 0	// [A] BFtok_colroot, SUN, sound_ENV, HYPNO_TARGET, HYPNO_OWN, SKY,  (sound like Section4's names, witch do the link. notice there is more names on Unk4Entry) 
	uint32_t number_Section5_Hitbox;	// 4
	uint32_t offset_Section5_Hitbox;	// 8
} PACKED;
static_assert(sizeof(FMP_Section5) == 0xC, "Incorrect structure size.");




struct FMP_Section5_Hitbox
{
	uint32_t name_offset;	// 0			=> BOX			[A] BOX, SPHERE, and a lot of names (sometime the same as Unk5Entry's names, but there is more name in this list).
	
	uint16_t child;			// 4			=> FF FF => null
	uint16_t unk_a0;		// 6			=> FF FF => null	[A] only 0 of 0xffff, may be a Bool  (may be for size)
	uint16_t sibling;		// 8			=> FF FF => null
	uint16_t parent;		// A			=> FF FF => null	[A] only 0 of 0xffff
	
	uint32_t number_Section5_Hitbox_b;	// E	=> [A] always 0
	uint32_t offset_Section5_Hitbox_b;	// 10	=> ref to Section5_Box_b

	uint32_t offset_Section5_Hitbox_f;	// 14 only in new version.

	uint32_t number_Section5_Hitbox_e;	// 18	=> 0 [A] value in [0, 0x53da], number of Section5_Box_e
	uint32_t offset_Section5_Hitbox_e;	// 1C	=> 0 => Ref to Section5_Box_e
	uint32_t number_Indexes;			// 20	=> 0 [A] count of series of uint16_t values (list of Id, may the one of each Section5_Box_e (same number)). if not null (and other unknowed cases), the next value is the offset_listIndex
	uint32_t offset_Indexes;			// 24

} PACKED;
static_assert(sizeof(FMP_Section5_Hitbox) == 0x28, "Incorrect structure size.");


struct FMP_Section5_Hitbox_Old_V0x0x208XX	//Old version of the File
{
	uint32_t name_offset;	// 0			=> BOX			[A] BOX, SPHERE, and a lot of names (sometime the same as Unk5Entry's names, but there is more name in this list).

	uint16_t child;			// 4			=> FF FF => null
	uint16_t unk_a0;		// 6			=> FF FF => null	[A] only 0 of 0xffff, may be a Bool  (may be for size)
	uint16_t sibling;		// 8			=> FF FF => null
	uint16_t parent;		// A			=> FF FF => null	[A] only 0 of 0xffff

	uint32_t number_Section5_Hitbox_b;	// E	=> [A] always 0
	uint32_t offset_Section5_Hitbox_b;	// 10	=> ref to Section5_Box_b

	uint32_t number_Section5_Hitbox_e;	// 14	=> 0 [A] value in [0, 0x53da], number of Section5_Box_e
	uint32_t offset_Section5_Hitbox_e;	// 18	=> 0 => Ref to Section5_Box_e
	uint32_t number_Indexes;			// 1C	=> 0 [A] count of series of uint16_t values (list of Id, may the one of each Section5_Box_e (same number)). if not null (and other unknowed cases), the next value is the offset_listIndex
	uint32_t offset_Indexes;			// 20

} PACKED;
static_assert(sizeof(FMP_Section5_Hitbox_Old_V0x0x208XX) == 0x24, "Incorrect structure size.");




struct FMP_Section5_Hitbox_b
{
	uint32_t number_Section5_Hitbox_c;	// 0			=> 0
	uint32_t offset_Section5_Hitbox_c;	// 4			=> ref to Section5_Box_c
} PACKED;
static_assert(sizeof(FMP_Section5_Hitbox_b) == 0x8, "Incorrect structure size.");


struct FMP_Section5_Hitbox_c
{
	uint32_t unk_0;			// 0			=> 0
	uint32_t offset_Section5_Hitbox_d;	// 4			=> ref to a Section5_Box_d
	uint32_t unk_1;			// 8			=> 0 [A] always 0
	uint32_t unk_2;			// C			=> 0 [A] always 0
	uint32_t size_Section5_File; // 10		=> 0 size in octets of part started by unk3_offset (seam to be a file inserted)
	uint32_t offset_Section5_File; // 14	=> 0 start of a part (seam to be a file inserted)
	uint32_t offset_Section5_Hitbox_d_2; // 18	=> ref to a Section5_Box_d
	uint32_t unk_5;			// 1C			=> 0 [A] always 0
	uint32_t unk_6;			// 20			=> 0 [A] only 0 or 0x3c23d70a
